src/config/DataProcessors/ОбновитьСтатусыКонтрагентовПоВидамТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<DataProcessor>
		<Properties>
			<Name>ОбновитьСтатусыКонтрагентовПоВидамТоваров</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/config/InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьБезСкидок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателяСезонный</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/config/InformationRegisters/СтатусыКонтрагентовПоТоварнымГруппам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>СтатусыКонтрагентовПоТоварнымГруппам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТоварнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/Enums/ВидыТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ВидыТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Шины</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Диски</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтоЗапчасти</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АКБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аксессуары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КрышкиНаклейки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РекламнаяПродукция</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/config/Enums/КатегорииКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>КатегорииКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Потенциальные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРазработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работающие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеРаботающиеБольшеГода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрылись</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВременноНеРаботаем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПерваяПродажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разобраться</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/config/DataProcessors/ОбновитьСтатусыКонтрагентовПоВидамТоваров/Ext/ObjectModule.bsl
Функция ПолучитьТекстЗапросаСтатусы()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект КАК Контрагент,
	|	ЗначенияСвойствОбъектов.Значение КАК РабГруппа
	|ПОМЕСТИТЬ РабГруппы
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = &СвойствоРабГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыТоваров.Шины) КАК ВидТовара
	|ПОМЕСТИТЬ втВидыТоваров
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыТоваров.Диски)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыТоваров.Акб)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыТоваров.Аксессуары)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент,
	|	ЕСТЬNULL(РабГруппы.РабГруппа, Контрагенты.Ссылка) КАК РабГруппа,
	|	втВидыТоваров.ВидТовара
	|ПОМЕСТИТЬ Покупатели
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РабГруппы КАК РабГруппы
	|		ПО Контрагенты.Ссылка = РабГруппы.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ втВидыТоваров КАК втВидыТоваров
	|		ПО (ИСТИНА)
	|ГДЕ
	|	Контрагенты.Покупатель = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(ПродажиОбороты.Регистратор КАК Документ.РеализацияТоваровУслуг) КАК ДокументПродажи,
	|	ЕСТЬNULL(РабГруппы.РабГруппа, ПродажиОбороты.Регистратор.Контрагент) КАК РабГруппа,
	|	ПродажиОбороты.Номенклатура.ВидТовара КАК ВидТовара
	|ПОМЕСТИТЬ ДокументыПродажи
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(, , Регистратор, ) КАК ПродажиОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РабГруппы КАК РабГруппы
	|		ПО ПродажиОбороты.ДоговорКонтрагента.Владелец = РабГруппы.Контрагент
	|ГДЕ
	|	ПродажиОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Покупатели.РабГруппа КАК РабГруппа,
	|	Покупатели.Контрагент КАК Контрагент,
	|	Покупатели.ВидТовара КАК ВидТовара,
	|	МАКСИМУМ(ДокументыПродажи.ДокументПродажи.Дата) КАК ДокПродажиДата,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДокументыПродажи.ДокументПродажи) КАК КоличПродаж
	|ПОМЕСТИТЬ СДатойРеализации
	|ИЗ
	|	Покупатели КАК Покупатели
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыПродажи КАК ДокументыПродажи
	|		ПО Покупатели.РабГруппа = ДокументыПродажи.РабГруппа
	|			И Покупатели.ВидТовара = ДокументыПродажи.ВидТовара
	|
	|СГРУППИРОВАТЬ ПО
	|	Покупатели.Контрагент,
	|	Покупатели.РабГруппа,
	|	Покупатели.ВидТовара
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СДатойРеализации.Контрагент КАК Контрагент,
	|	СДатойРеализации.ВидТовара КАК ВидТовара,
	|	ВЫБОР
	|		КОГДА СтатусыКонтрагентовПоТоварнымГруппам.Статус = ЗНАЧЕНИЕ(Перечисление.КатегорииКонтрагентов.Закрылись)
	|				ИЛИ СтатусыКонтрагентовПоТоварнымГруппам.Статус = ЗНАЧЕНИЕ(Перечисление.КатегорииКонтрагентов.ВременноНеРаботаем)
	|				ИЛИ СтатусыКонтрагентовПоТоварнымГруппам.Статус = ЗНАЧЕНИЕ(Перечисление.КатегорииКонтрагентов.Разобраться)
	|			ТОГДА СтатусыКонтрагентовПоТоварнымГруппам.Статус
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СДатойРеализации.ДокПродажиДата ЕСТЬ NULL 
	|					ТОГДА ВЫБОР
	|							КОГДА Авторизация.Ссылка ЕСТЬ NULL 
	|								ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииКонтрагентов.Потенциальные)
	|							ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.КатегорииКонтрагентов.ВРазработке)
	|						КОНЕЦ
	|				ИНАЧЕ ВЫБОР
	|						КОГДА СДатойРеализации.ДокПродажиДата < ДОБАВИТЬКДАТЕ(&ТекДата, МЕСЯЦ, -12)
	|							ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииКонтрагентов.НеРаботающиеБольшеГода)
	|						КОГДА СДатойРеализации.КоличПродаж = 1
	|							ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииКонтрагентов.ПерваяПродажа)
	|						ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.КатегорииКонтрагентов.Работающие)
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК НовСтатус,
	|	СтатусыКонтрагентовПоТоварнымГруппам.Статус КАК ТекСтатус,
	|	СДатойРеализации.ДокПродажиДата,
	|	СтатусыКонтрагентовПоТоварнымГруппам.Ответственный
	|ИЗ
	|	СДатойРеализации КАК СДатойРеализации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Авторизация КАК Авторизация
	|		ПО СДатойРеализации.Контрагент = Авторизация.Владелец
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыКонтрагентовПоТоварнымГруппам КАК СтатусыКонтрагентовПоТоварнымГруппам
	|		ПО СтатусыКонтрагентовПоТоварнымГруппам.Контрагент = СДатойРеализации.Контрагент
	|			И СтатусыКонтрагентовПоТоварнымГруппам.ТоварнаяГруппа = СДатойРеализации.ВидТовара
	|ГДЕ
	|	(СтатусыКонтрагентовПоТоварнымГруппам.Статус ЕСТЬ NULL 
	|			ИЛИ НЕ СтатусыКонтрагентовПоТоварнымГруппам.Статус = ВЫБОР
	|					КОГДА СтатусыКонтрагентовПоТоварнымГруппам.Статус = ЗНАЧЕНИЕ(Перечисление.КатегорииКонтрагентов.Закрылись)
	|							ИЛИ СтатусыКонтрагентовПоТоварнымГруппам.Статус = ЗНАЧЕНИЕ(Перечисление.КатегорииКонтрагентов.ВременноНеРаботаем)
	|							ИЛИ СтатусыКонтрагентовПоТоварнымГруппам.Статус = ЗНАЧЕНИЕ(Перечисление.КатегорииКонтрагентов.Разобраться)
	|						ТОГДА СтатусыКонтрагентовПоТоварнымГруппам.Статус
	|					ИНАЧЕ ВЫБОР
	|							КОГДА СДатойРеализации.ДокПродажиДата ЕСТЬ NULL 
	|								ТОГДА ВЫБОР
	|										КОГДА Авторизация.Ссылка ЕСТЬ NULL 
	|											ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииКонтрагентов.Потенциальные)
	|										ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.КатегорииКонтрагентов.ВРазработке)
	|									КОНЕЦ
	|							ИНАЧЕ ВЫБОР
	|									КОГДА СДатойРеализации.ДокПродажиДата < ДОБАВИТЬКДАТЕ(&ТекДата, МЕСЯЦ, -12)
	|										ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииКонтрагентов.НеРаботающиеБольшеГода)
	|									КОГДА СДатойРеализации.КоличПродаж = 1
	|										ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииКонтрагентов.ПерваяПродажа)
	|									ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.КатегорииКонтрагентов.Работающие)
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОНЕЦ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидТовара
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Возврат ТекстЗапроса;
	
КонецФункции // ПолучитьТекстЗапросаСтатусы()


Процедура ВыполнитьОбновлениеСтатусовКонтрагентовПоНоменклГруппам() Экспорт
	
	#Если Клиент Тогда
		Сообщить("Начало обработки: " + ТекущаяДата());
	#КонецЕсли
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаСтатусы();
	
	ТекДата = ТекущаяДата();
	СвойствоРабГруппа = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("90230");
	
	Запрос.УстановитьПараметр("СвойствоРабГруппа", СвойствоРабГруппа);
	Запрос.УстановитьПараметр("ТекДата"          , ТекДата);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для каждого стр из Результат Цикл
		Запись = РегистрыСведений.СтатусыКонтрагентовПоТоварнымГруппам.СоздатьМенеджерЗаписи();
		Запись.Контрагент = Стр.Контрагент;
		Запись.ТоварнаяГруппа = стр.ВидТовара;
		Запись.Ответственный = стр.Ответственный;
		Запись.Статус = Стр.НовСтатус;
		Запись.Записать(Истина);	
	конецЦикла;
	
	#Если Клиент Тогда
		Сообщить("Окончание обработки: " + ТекущаяДата());
	#КонецЕсли
	
КонецПроцедуры // ВыполнитьОбновлениеСтатусовКонтрагентовПоНоменклГруппам()
